In [1]:
from time import time
import pandas as pd

# Combined data

In [2]:
path = "../data/"
filename1 = "combined_data_1.txt"
print(filename1)
filename_out = "combined_data_con_id.csv"
print(filename_out)

combined_data_1.txt
combined_data_con_id.csv

In [3]:
def filepath(filename,extension,i,path=path):
    return path + f"{filename}_{i}.{extension}"

In [4]:
%%time
# Abre el archivo en modo lectura
id_movie = -1
with open(path+filename_out, "w") as output_file:
    print(f"output filepath:\t{path+filename_out}")
    for i in range(1,5):
        filepath_aux = filepath("combined_data","txt",i)
        print(f"input filepath {i}:\t{filepath_aux}",end="")
        t0=time()
        with open(filepath_aux) as input_file:
            for linea in input_file:
                if linea.endswith(':\n'):
                    id_movie = linea[:-2]
                else:
                    output_file.write(f"{id_movie},{linea}")
        t1=time()
        print(f"\tTiempo: {(t1-t0):3.2f} s")

output filepath:	../data/combined_data_con_id.csv
input filepath 1:	../data/combined_data_1.txt	Tiempo: 66.73 s
input filepath 2:	../data/combined_data_2.txt	Tiempo: 73.50 s
input filepath 3:	../data/combined_data_3.txt	Tiempo: 59.22 s
input filepath 4:	../data/combined_data_4.txt	Tiempo: 69.94 s
Wall time: 4min 29s

In [5]:
%%time
df = pd.read_csv(path+filename_out,header=0,names=['id_movie','id_client','rate','rate_day'])
df.head()

Wall time: 1min 31s

   id_movie  id_client  rate    rate_day
0         1     822109     5  2005-05-13
1         1     885013     4  2005-10-19
2         1      30878     4  2005-12-26
3         1     823519     3  2004-05-03
4         1     893988     3  2005-11-17

In [6]:
df.shape

(100480506, 4)

In [7]:
%%time
df.to_parquet(path+filename_out.split('.')[0]+'.gzip',compression='gzip')

Wall time: 2min 26s

In [8]:
%%time
df_read=pd.read_parquet(path+filename_out.split('.')[0]+'.gzip')

Wall time: 1min 2s

In [9]:
df_read.head(100)

    id_movie  id_client  rate    rate_day
0          1     822109     5  2005-05-13
1          1     885013     4  2005-10-19
2          1      30878     4  2005-12-26
3          1     823519     3  2004-05-03
4          1     893988     3  2005-11-17
..       ...        ...   ...         ...
95         1     593225     3  2004-07-11
96         1    1011918     4  2005-05-28
97         1    1665054     4  2005-07-06
98         1    2630337     5  2005-03-10
99         1    1155747     3  2005-07-03

[100 rows x 4 columns]

In [10]:
df_read.tail(100)

           id_movie  id_client  rate    rate_day
100480406     17770    1461435     1  2005-12-08
100480407     17770     243499     3  2004-04-19
100480408     17770    1602153     2  2004-04-12
100480409     17770      96627     3  2004-11-24
100480410     17770    2334295     3  2005-04-04
...             ...        ...   ...         ...
100480501     17770    1790158     4  2005-11-01
100480502     17770    1608708     3  2005-07-19
100480503     17770     234275     1  2004-08-07
100480504     17770     255278     4  2004-05-28
100480505     17770     453585     2  2005-03-10

[100 rows x 4 columns]

In [11]:
df_top_100 = df.groupby('id_client',group_keys=False).head(100)
df_top_100.head()

   id_movie  id_client  rate    rate_day
0         1     822109     5  2005-05-13
1         1     885013     4  2005-10-19
2         1      30878     4  2005-12-26
3         1     823519     3  2004-05-03
4         1     893988     3  2005-11-17

In [12]:
%%time
df_top_100.head(100*100).to_csv(path+filename_out.split('.')[0]+'_top100.csv')

Wall time: 356 ms

# Qualifying

In [13]:
path = "../data/"
filename1 = "qualifying.txt"
filepath1 = path+filename1
print(filepath1)
filename_out = "qualifying.csv"
filepath2 = path+filename_out
print(filepath2)

../data/qualifying.txt
../data/qualifying.csv

In [14]:
%%time
# Abre el archivo en modo lectura
id_movie = 0

with open(filepath1, "r") as input_file:
    with open(filepath2, "w") as output_file:
        for linea in input_file:
            if linea.endswith(':\n'):
                id_movie = linea[:-2]
            else:
                output_file.write(f"{id_movie},{linea}")

Wall time: 7.47 s

In [15]:
%%time
df = pd.read_csv(filepath2,header=None,names=['id_movie','id_client','rate_day'],parse_dates=[2])
#df = pd.read_csv(filepath2,header=None,names=['id_client','id_movie','rate_day'])
df.head()

Wall time: 2.65 s

   id_movie  id_cliente   rate_day
0         1     1046323 2005-12-19
1         1     1080030 2005-12-23
2         1     1830096 2005-03-14
3         1      368059 2005-05-26
4         1      802003 2005-11-07

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2817131 entries, 0 to 2817130
Data columns (total 3 columns):
 #   Column      Dtype
---  ------      -----
 0   id_movie    int64
 1   id_cliente  int64
 2   rate_day    datetime64[ns]
dtypes: datetime64[ns](1), int64(2)
memory usage: 64.5 MB

# Probe

In [17]:
path = "../data/"
filename1 = "probe.txt"
filepath1 = path+filename1
print(filepath1)
filename_out = "probe.csv"
filepath2 = path+filename_out
print(filepath2)

../data/probe.txt
../data/probe.csv

In [18]:
%%time
# Abre el archivo en modo lectura
id_movie = 0

with open(filepath1, "r") as input_file:
    with open(filepath2, "w") as output_file:
        for linea in input_file:
            if linea.endswith(':\n'):
                id_movie = linea[:-2]
            else:
                output_file.write(f"{id_movie},{linea}")

Wall time: 3.65 s

In [19]:
%%time
df = pd.read_csv(filepath2,header=None,names=['id_movie','id_cliente'])
df.head()

Wall time: 531 ms

   id_movie  id_cliente
0         1       30878
1         1     2647871
2         1     1283744
3         1     2488120
4         1      317050

# Movie Titles

In [3]:
%%time

# Queremos evitar que las peliculas que tienen comas en el titulo den problemas

with open('../data/movie_titles.csv', "w") as output_file:
    
    with open('../data/movie_titles_orig.csv') as input_file:
        
        for linea in input_file:
            
            linea_splt = linea.split(',')
            
            nueva_linea = ';'.join([linea_splt[0],linea_splt[1],','.join(linea_splt[2:])])
            
            output_file.write(nueva_linea)

Wall time: 117 ms